In [1]:
import pandas as pd

In [4]:
data = {'State': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'Year': [2000, 2001, 2002, 2001, 2002, 2003],
        'Pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
        }
df = pd.DataFrame(data)
df

    State  Year  Pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [49]:
df = pd.DataFrame(data, columns=['Year','State','Pop','Capital'],index = ['one','two','three','four','five','six'])
df['Capital']=['Columbus', 'Columbus', 'Columbus', 'Carson', 'Carson', 'Carson']
df

       Year   State  Pop   Capital
one    2000    Ohio  1.5  Columbus
two    2001    Ohio  1.7  Columbus
three  2002    Ohio  3.6  Columbus
four   2001  Nevada  2.4    Carson
five   2002  Nevada  2.9    Carson
six    2003  Nevada  3.2    Carson

In [48]:
val = pd.Series(['Columbus','Columbus','Carson'],index= ['one','two','four'])
df['Capital']=val
df

       Year   State  Pop   Capital
one    2000    Ohio  1.5  Columbus
two    2001    Ohio  1.7  Columbus
three  2002    Ohio  3.6       NaN
four   2001  Nevada  2.4    Carson
five   2002  Nevada  2.9       NaN
six    2003  Nevada  3.2       NaN

In [50]:
df.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [51]:
df.columns

Index(['Year', 'State', 'Pop', 'Capital'], dtype='object')

In [52]:
df[['Capital','Year']]

        Capital  Year
one    Columbus  2000
two    Columbus  2001
three  Columbus  2002
four     Carson  2001
five     Carson  2002
six      Carson  2003

In [53]:
df.loc['one']

Year           2000
State          Ohio
Pop             1.5
Capital    Columbus
Name: one, dtype: object

In [54]:
df['Capital']

one      Columbus
two      Columbus
three    Columbus
four       Carson
five       Carson
six        Carson
Name: Capital, dtype: object

In [83]:
pop ={'Ohio':{2001: 2.4, 2002:2.8}, #dic in dic. {key:{value{key:value}}}
'Nevada':{2002: 4.4,2001:2.3, 2005:2.8}}
df1 = pd.DataFrame(pop)
df1

      Ohio  Nevada
2001   2.4     2.3
2002   2.8     4.4
2005   NaN     2.8

In [84]:
pd.DataFrame(pop, index = [2001,2002,2003])

      Ohio  Nevada
2001   2.4     2.3
2002   2.8     4.4
2003   NaN     NaN

In [85]:
pdata = {'Ohio':df1['Ohio'][:-1], #picking data from old dictionary when same keys
        'Nevada': df1['Nevada'][0:2]}
df2 = pd.DataFrame(pdata)
df2

      Ohio  Nevada
2001   2.4     2.3
2002   2.8     4.4

In [86]:
df1.index.name = 'Year'; df1.columns.name= 'State'
df1

State  Ohio  Nevada
Year
2001    2.4     2.3
2002    2.8     4.4
2005    NaN     2.8

In [87]:
df1.values

array([[2.4, 2.3],
       [2.8, 4.4],
       [nan, 2.8]])

# 5.2 Essential Functionality

ReIndexing

In [90]:
obj = pd.Series([4.5,7.2,-5.3,3.6], index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [92]:
obj1 = obj.reindex(['a','b','c','d','e'])
obj1

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [95]:
obj2 = pd.Series(['blue','purple','yellow'], index=[0,2,4])
obj2

0      blue
2    purple
4    yellow
dtype: object

In [96]:
obj2.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [99]:
obj2.reindex(range(6) ,method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [103]:
obj2.reindex(range(6) ,method = 'bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

ReIndexing on Series

In [110]:
import numpy as np
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                     index=['a','c','d'],
                     columns = ['Ohio','Texas','California'])

In [111]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [154]:
frame1 = frame.reindex(['a','b','c','d','e'])

In [155]:
frame1

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0
e   NaN    NaN         NaN

In [156]:
states = ['Texas','Utah','California'] #added row which was not in data
frame1.reindex(columns=states) #reindex column

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0
e    NaN   NaN         NaN

In [157]:
frame1.reindex(index=['f','b','a','d','c','g'], columns=['Texas','NewYork','Utah', 'California', 'Bay'])

   Texas  NewYork  Utah  California  Bay
f    NaN      NaN   NaN         NaN  NaN
b    NaN      NaN   NaN         NaN  NaN
a    1.0      NaN   NaN         2.0  NaN
d    7.0      NaN   NaN         8.0  NaN
c    4.0      NaN   NaN         5.0  NaN
g    NaN      NaN   NaN         NaN  NaN

In [158]:
data = pd.DataFrame(np.arange(1,101).reshape((20,5)),
                   columns=list('ABCDE'), #columns = ['a','b','c','d','e'],  #5 columns so five names
                    index = range(1,101,5)) 
data

     A   B   C   D    E
1    1   2   3   4    5
6    6   7   8   9   10
11  11  12  13  14   15
16  16  17  18  19   20
21  21  22  23  24   25
26  26  27  28  29   30
31  31  32  33  34   35
36  36  37  38  39   40
41  41  42  43  44   45
46  46  47  48  49   50
51  51  52  53  54   55
56  56  57  58  59   60
61  61  62  63  64   65
66  66  67  68  69   70
71  71  72  73  74   75
76  76  77  78  79   80
81  81  82  83  84   85
86  86  87  88  89   90
91  91  92  93  94   95
96  96  97  98  99  100

In [159]:
frame1.loc['c']['California'] #or['c']['2']

5.0

In [160]:
frame1.loc[::-1,::-1]

   California  Texas  Ohio
e         NaN    NaN   NaN
d         8.0    7.0   6.0
c         5.0    4.0   3.0
b         NaN    NaN   NaN
a         2.0    1.0   0.0

In [161]:
frame1.iloc[0:3] 
#iloc doesn't count last indec eg:3

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0

In [162]:
frame1.loc['a':'c']

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0

In [163]:
frame1.loc['b']['Ohio']=2
frame1

   Ohio  Texas  California
a   0.0    1.0         2.0
b   2.0    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0
e   NaN    NaN         NaN

In [164]:
frame1.loc['b'][2]=2
frame1

   Ohio  Texas  California
a   0.0    1.0         2.0
b   2.0    NaN         2.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0
e   NaN    NaN         NaN

In [169]:
frame1.loc['b'][[0,2]]=[4,6] #multiple values change/edit
frame1

   Ohio  Texas  California
a   0.0    1.0         2.0
b   4.0    NaN         6.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0
e   NaN    NaN         NaN

In [170]:
frame1.loc['b'][[2,0]] = frame1.loc['b'][[0,2]] #swapping values
frame1

   Ohio  Texas  California
a   0.0    1.0         2.0
b   6.0    NaN         4.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0
e   NaN    NaN         NaN

In [174]:
frame1['Texas'][1]+5 #nan added in any number results nan

nan

In [210]:
frame2= frame1.copy()
frame2['San Francisco']= [1,2,3,4,5]
frame2

   Ohio  Texas  California  San Francisco
a   0.0    1.0         2.0              1
b   6.0    NaN         4.0              2
c   3.0    4.0         5.0              3
d   6.0    7.0         8.0              4
e   NaN    NaN         NaN              5

In [211]:
frame2+5

   Ohio  Texas  California  San Francisco
a   5.0    6.0         7.0              6
b  11.0    NaN         9.0              7
c   8.0    9.0        10.0              8
d  11.0   12.0        13.0              9
e   NaN    NaN         NaN             10

In [212]:
frame2.loc['a':'d':-1]

Empty DataFrame
Columns: [Ohio, Texas, California, San Francisco]
Index: []

In [213]:
frame2.loc['d'::-1]

   Ohio  Texas  California  San Francisco
d   6.0    7.0         8.0              4
c   3.0    4.0         5.0              3
b   6.0    NaN         4.0              2
a   0.0    1.0         2.0              1

In [214]:
frame2.loc[::-1]['Texas':]

Empty DataFrame
Columns: [Ohio, Texas, California, San Francisco]
Index: []

In [215]:
frame2.loc[::-1,'Texas'::-1]

   Texas  Ohio
e    NaN   NaN
d    7.0   6.0
c    4.0   3.0
b    NaN   6.0
a    1.0   0.0

In [216]:
abs(-67)

67

In [217]:
frame2[frame2 > 5]

   Ohio  Texas  California  San Francisco
a   NaN    NaN         NaN            NaN
b   6.0    NaN         NaN            NaN
c   NaN    NaN         NaN            NaN
d   6.0    7.0         8.0            NaN
e   NaN    NaN         NaN            NaN

In [218]:
pd.isnull(frame2)

    Ohio  Texas  California  San Francisco
a  False  False       False          False
b  False   True       False          False
c  False  False       False          False
d  False  False       False          False
e   True   True        True          False

In [222]:
frame2.fillna(0, inplace=True)
frame2

   Ohio  Texas  California  San Francisco
a   0.0    1.0         2.0              1
b   6.0    0.0         4.0              2
c   3.0    4.0         5.0              3
d   6.0    7.0         8.0              4
e   0.0    0.0         0.0              5